Importing packages

In [13]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [ ]:
Reading dataset

In [10]:
data=pd.read_csv('//Users/shankariseethalaksmimohanakrishnan/Documents/Data-science/artifacts/StudentsPerformance.csv')

In [ ]:
Show top 5 records

In [11]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [ ]:
Shape of dataset

In [12]:
data.shape

(1000, 8)

Checking missing values

In [15]:
data.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

Checking for duplicates

In [17]:
data.duplicated().sum()

0

To check datatypes

In [20]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

Determine number of unique values for each column

In [21]:
data.nunique()

gender                          2
race/ethnicity                  5
parental level of education     6
lunch                           2
test preparation course         2
math score                     81
reading score                  72
writing score                  77
dtype: int64

Understanding the numberical variables

In [23]:
data.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

Data Exploration

In [24]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [35]:
data=data.rename({
                  'race/ethnicity':'race_ethnicity',
                  'parental level of education':'parental_level_of_education',
                  'test preparation course':'test_preparation_course',
                  'math score':'math_score',
                  'reading score':'reading_score',
                  'writing score':'writing_score'
                 },
                 axis='columns')

In [36]:
data.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

Determine unique values for each categorical column

In [42]:
print("unique values in gender column", end=" ")
print(data.gender.unique())
print("unique values in race/ethinicity column", end=" ")
print(data.race_ethnicity.unique())
print("unique values in parental level of education column", end=" ")
print(data['parental_level_of_education'].unique())
print("unique values in lunch column", end=" ")
print(data['lunch'].unique())
print('unique values of test preperation course', end=" ")
print(data['test_preparation_course'].unique())

unique values in gender column ['female' 'male']
unique values in race/ethinicity column ['group B' 'group C' 'group A' 'group D' 'group E']
unique values in parental level of education column ["bachelor's degree" 'some college' "master's degree" "associate's degree"
 'high school' 'some high school']
unique values in lunch column ['standard' 'free/reduced']
unique values of test preperation course ['none' 'completed']

In [47]:
data.dtypes

gender                         object
race_ethnicity                 object
parental_level_of_education    object
lunch                          object
test_preparation_course        object
math_score                      int64
reading_score                   int64
writing_score                   int64
dtype: object